exports.operator = {
    //电信
    "133": { name: "电信", a: "公众移动通信网号" },
    "149": { name: "电信", a: "公众移动通信网号" },
    "153": { name: "电信", a: "公众移动通信网号" },
    "173": { name: "电信", a: "公众移动通信网号" },
    "177": { name: "电信", a: "公众移动通信网号" },
    "180": { name: "电信", a: "公众移动通信网号" },
    "181": { name: "电信", a: "公众移动通信网号" },
    "189": { name: "电信", a: "公众移动通信网号" },
    "199": { name: "电信", a: "公众移动通信网号" },


    //联通
    "130": { name: "联通", a: "公众移动通信网号" },
    "131": { name: "联通", a: "公众移动通信网号" },
    "132": { name: "联通", a: "公众移动通信网号" },
    "155": { name: "联通", a: "公众移动通信网号" },
    "156": { name: "联通", a: "公众移动通信网号" },
    "145": { name: "联通", a: "公众移动通信网号" },
    "175": { name: "联通", a: "公众移动通信网号" },
    "176": { name: "联通", a: "公众移动通信网号" },
    "185": { name: "联通", a: "公众移动通信网号" },
    "186": { name: "联通", a: "公众移动通信网号" },
    "166": { name: "联通", a: "公众移动通信网号" },


    //移动
    "135": { name: "移动", a: "公众移动通信网号" },
    "136": { name: "移动", a: "公众移动通信网号" },
    "137": { name: "移动", a: "公众移动通信网号" },
    "138": { name: "移动", a: "公众移动通信网号" },
    "139": { name: "移动", a: "公众移动通信网号" },
    "147": { name: "移动", a: "公众移动通信网号" },
    "150": { name: "移动", a: "公众移动通信网号" },
    "151": { name: "移动", a: "公众移动通信网号" },
    "152": { name: "移动", a: "公众移动通信网号" },
    "157": { name: "移动", a: "公众移动通信网号" },
    "158": { name: "移动", a: "公众移动通信网号" },
    "159": { name: "移动", a: "公众移动通信网号" },
    "178": { name: "移动", a: "公众移动通信网号" },
    "182": { name: "移动", a: "公众移动通信网号" },
    "183": { name: "移动", a: "公众移动通信网号" },
    "184": { name: "移动", a: "公众移动通信网号" },
    "187": { name: "移动", a: "公众移动通信网号" },
    "188": { name: "移动", a: "公众移动通信网号" },
    "198": { name: "移动", a: "公众移动通信网号" },

    //134(0-8)
    "1340": { name: "移动", a: "公众移动通信网号" },
    "1341": { name: "移动", a: "公众移动通信网号" },
    "1342": { name: "移动", a: "公众移动通信网号" },
    "1343": { name: "移动", a: "公众移动通信网号" },
    "1344": { name: "移动", a: "公众移动通信网号" },
    "1345": { name: "移动", a: "公众移动通信网号" },
    "1346": { name: "移动", a: "公众移动通信网号" },
    "1347": { name: "移动", a: "公众移动通信网号" },
    "1348": { name: "移动", a: "公众移动通信网号" },

    //虚拟运营商
    "1700": { name: "电信", a: "虚拟运营商" },
    "1701": { name: "电信", a: "虚拟运营商" },
    "1702": { name: "电信", a: "虚拟运营商" },

    "1703": { name: "移动", a: "虚拟运营商" },
    "1705": { name: "移动", a: "虚拟运营商" },
    "1706": { name: "移动", a: "虚拟运营商" },

    "1704": { name: "联通", a: "虚拟运营商" },
    "1707": { name: "联通", a: "虚拟运营商" },
    "1708": { name: "联通", a: "虚拟运营商" },
    "1709": { name: "联通", a: "虚拟运营商" },
    "171": { name: "联通", a: "虚拟运营商" },

    //其他
    "1349": { name: "移动", a: "卫星通信" },
    //物联网网号
    "1410": { name: "电信", a: "物联网网号" },

    "148": { name: "移动", a: "物联网业务专用号段" },
    "1440": { name: "移动", a: "物联网网号" },

    "146": { name: "联通", a: "物联网业务专用号段" },
    //卫星移动通信业务号
    "1740": { name: "电信", a: "卫星移动通信业务号" },
    "1741": { name: "电信", a: "卫星移动通信业务号" },
    "1742": { name: "电信", a: "卫星移动通信业务号" },
    "1743": { name: "电信", a: "卫星移动通信业务号" },
    "1744": { name: "电信", a: "卫星移动通信业务号" },
    "1745": { name: "电信", a: "卫星移动通信业务号" },

}